In [13]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 5.1 pandas structure(series, dataframe)

series: index 있는 1d array / index를 key로 갖는 dictionary

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) # 이렇게 따로 지정 가능
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
# index 이용한 추출 가능
obj2['a']

-5

In [9]:
obj2[['a', 'd']]

a   -5
d    4
dtype: int64

In [10]:
#dictionary바로 series로 바꿀 수 있음
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

.isnull, .notnull로 NA 확인

In [ ]:
# series object 랑 index 각각 name 부여 가능
obj4.name = 'population'
obj4.index.name = 'state'
obj4

Dataframe: 행과 열 index 모두 있는 table

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [7]:
frame
# frame.head()로 맨 윗 5열만 볼 수 있음

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
# columns로 열 순서 조정
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [8]:
# index 이름 별도 지정
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2 # debt는 값이 없어서 NaN 출력

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

dataframe[] or dataframe. 으로 해당되는 column을 series로 출력

In [9]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [10]:
frame2.year #대신 이건 . 뒤에 나오는게 python 변수명으로 적절해야됨

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

row는 loc으로 출력

In [11]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [14]:
#이렇게 수정도 가능
frame2.debt=np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [15]:
# 그냥 새로운 index 지정으로 column 추가하고
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5     0     True
two    2001    Ohio  1.7     1     True
three  2002    Ohio  3.6     2     True
four   2001  Nevada  2.4     3    False
five   2002  Nevada  2.9     4    False
six    2003  Nevada  3.2     5    False

In [16]:
# del로 삭제 가능
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [27]:
# dictionary 안에 또 dictionary가 있다면 바깥쪽 key는 column, 안의 key는 row index로!
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop=pd.DataFrame(pop, index={2000, 2001, 2002})
pop
# pop.T로 transpose 가능

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [28]:
pop['Ohio'][:-2]

2000    1.5
Name: Ohio, dtype: float64

In [29]:
pop['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [30]:
pdata = {'Ohio': pop['Ohio'][:-1],
         'Nevada': pop['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [32]:
# index와 column의 이름도 지정 가능
pop.index.name = 'year'; pop.columns.name = 'state'
pop

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [33]:
# array로 출력
pop.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [34]:
# index 출력
pop.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [35]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [36]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [37]:
obj2.index is labels

True

In [39]:
# indec is immutable!
labels[1] = 'd'

TypeError: Index does not support mutable operations

In [40]:
# set 처럼 이런거도 가능
'Ohio' in pop.columns

True

In [41]:
# index 니까 같은 거 여러개 있어도 됨
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# 5.2 essential functionality

In [42]:
# reindexing
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2 # e는 없으니까 NaN으로!

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [43]:
# method로 index 사이사이 채울 수 있음
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [44]:
# reindex: 그냥 쓰면 row, columns= 쓰면 column
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [46]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [47]:
# 이젠 loc에 missing value 넣으면 안됨....
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [49]:
frame.loc[['a', 'c', 'd'], 'Ohio']

a    0
c    3
d    6
Name: Ohio, dtype: int32

In [50]:
# drop: 행 또는 열 제거 (inplace로 그걸 복사 할건지 저장할건지)
# 그냥이 행, axis=1이 column
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [52]:
data.drop(['two', 'four'], axis='columns')
obj.drop('c', inplace=True)
obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [53]:
# Selection: numpy와 동일
# 대신 slicing 조금 다름(끝 포함)
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [54]:
# boolean 이용한 slicing
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
# loc vs iloc : loc은 name, iloc은 integer
# index가 integer일 때 index 이름이랑 integer이랑 헷갈리지 말 것
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [56]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [57]:
# arithmetic
# 더하면 index는 union으로! 값 없으면 NaN
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [58]:
# column 이름이 달라서 연산할 수 없음. NaN 출력
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1
df2
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [59]:
# .add 이용 (한쪽에만 값이 있으면 0으로 fill_value)
# reindex에서도 사용가능
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [60]:
# 1 / df1 대신 df1.rdiv(1) 도 사용가능. 같은 말.
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [62]:
# dataframe과 series의 연산: 자동으로 index 맞춰서 진행
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [63]:
# 연산을 행별로 진행하려면 .sub 후 axis 설정
series3 = frame['d']
frame
series3
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [64]:
# apply를 통해 함수 column별 적용 가능
# 행별로 진행하려면 axis='columns' 추가
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
f = lambda x: x.max() - x.min()
frame.apply(f)

b    0.787832
d    1.146652
e    2.149092
dtype: float64

In [65]:
# applymap으로는 elementwise 적용
# series 의 map 을 datadrame으로 확장한 것이라 생각
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.10  1.01   1.45
Ohio    -0.66  0.23   0.36
Texas   -0.33  1.38  -0.70
Oregon   0.13  0.84  -0.57

In [66]:
# sort_index(): index 순서 정렬
# axis, ascending=True 등으로 조절
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [67]:
# sort_values(~,  by=): value의 값 순서로 정렬
# by로 정렬 기준의 순서 정함
# NaN은 맨 마지막으로 감
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [68]:
# rank: 오름차순으로 순위 매김
# 같으면 평균(method='first')
obj.rank(method='first')

0    3.0
1    4.0
2    1.0
3    2.0
dtype: float64

In [69]:
# index 안 unique 해도 됨
# 확인 by is_unique
obj.index.is_unique

True

# 5.3 Summarizing and Computing Descriptive Statistics

In [70]:
# 여러 연산들  가능
# .sum, .mean 등
#skipna=True 면 na 건너뜀
# .idxmax()는 max인 값의 index 반환
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df.idxmax()

one    b
two    d
dtype: object

In [71]:
# describe으로 요약
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [72]:
conda install pandas-datareader

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\minzz\anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.9.2                |   py37haa95532_0         2.9 MB
    pandas-datareader-0.9.0    |             py_0          72 KB
    ------------------------------------------------------------
                                           Total:         2.9 MB

The following NEW packages will be INSTALLED:

  pandas-datareader  pkgs/main/noarch::pandas-datareader-0.9.0-py_0

The following packages will be UPDATED:

  conda                                        4.8.3-py37_0 --> 4.9.2-py37haa95532_0



Downloading and Extracting Packages

conda-4.9.2          | 2.9 MB    |            |   0%
conda-4.9.2          | 2.9 MB    | 2          |   2%
conda-4.9.2          | 2.9 MB    | #2         |  13%
conda-4.9.2          | 2.9 MB    | ####1      |  41%
conda-4.9.2          | 2.9 MB    | ########1  |  81%
conda-4.9.2          | 2.9 MB    | ########## | 100%

pandas-datareader-0. | 72 KB     |            |   0%
pandas-datareader-0. | 72 KB     | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [73]:
import pandas_datareader.data as web 
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [75]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [76]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-01-29 -0.037421 -0.008078 -0.029172 -0.014690
2021-02-01  0.016520  0.012006  0.033152  0.035740
2021-02-02  0.006337 -0.009126 -0.000584  0.013759
2021-02-03 -0.007778 -0.002679  0.014571  0.073961
2021-02-04  0.015105  0.009402 -0.008709 -0.006401

In [77]:
# 상관계수
returns['MSFT'].corr(returns['IBM'])

0.00015450908645908685

In [78]:
# 공분산
returns['MSFT'].cov(returns['IBM'])

0.00015450908645908685

In [79]:
# 전체
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.454256  0.709481  0.651268
IBM   0.454256  1.000000  0.540466  0.505733
MSFT  0.709481  0.540466  1.000000  0.778512
GOOG  0.651268  0.505733  0.778512  1.000000

In [80]:
# 특정 열과 모든 행의 corr
returns.corrwith(returns.IBM)

AAPL    0.454256
IBM     1.000000
MSFT    0.540466
GOOG    0.505733
dtype: float64

In [81]:
# unique로 value 당 하나만 추출
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [82]:
# value 당 몇 번 나왔는지 세어 줌
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [85]:
# ~.isin() 일 때 ~가 ()안에 있는 지 확인하는 것
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [86]:
# 대응되는 index 출력
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [87]:
# value_counts 한 것으로 column 별로 채우고, 없으면 0 넣기
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0